nc: 1
scales: # compound scaling constants [depth, width, max_channels]
    # n: [0.33, 0.25, 1024]  
    s: [0.33, 0.50, 1024]  # r=2 applied at 7,8,9,21
    # m: [0.67, 0.75, 768]
    # l: [1.00, 1.00, 512]
    # x: [1.00, 1.25, 512]

backbone:
- [-1, 1, Conv, [64,3,2,1]] 	                  # 0 / P1 (s2)
- [-1, 1, DSConv, [128,3,2,1]]                  # 1 / P2 (s4)
- [-1, 1, DSFF, [128,3]]                        # 2
- [-1, 1, DSConv, [256,3,2,1]]                  # 3 / P3 (s8)
- [-1, 1, DSFF, [256,6]]                        # 4
- [-1, 1, DSConv, [512,3,2,1]]                  # 5 / P4 (s16)
- [-1, 1, DSFF, [512,6]]                        # 6
- [-1, 1, DSConv, [1024,3,2,1]]                 # 7 / P5 (s32)
- [-1, 1, DSFF, [1024,3]]                       # 8
- [-1, 1, EPPF, [1024]]                         # 9

head:
- [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 10
- [[-1, 6], 1, Concat, [1]]                     # 11
- [-1, 1, DSFF, [512,3]]                        # 12
- [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 13
- [[-1, 4], 1, Concat, [1]]                     # 14
- [-1, 1, DSFF, [256,3]]                        # 15
- [-1, 1, GSConv, [256,3,2,1]]                  # 16
- [[-1, 12], 1, Concat, [1]]                    # 17
- [-1, 1, DSFF, [512,3]]                        # 18
- [-1, 1, GSConv, [512,3,2,1]]                  # 19
- [[-1, 9], 1, Concat, [1]]                     # 20
- [-1, 1, DSFF, [1024,3]]                       # 21
- [[15, 18, 21], 1, Detect, [nc]]